"""
Создать еще одну переменную равную среднему арифметическому возрасту, и вывести это значение на экран.
"""

valera = 36
roma = 35
dima = 31

avg_ag = (valera + roma + dima) / 3
print(avg_ag)