"""
Создать три переменные, содержащие возраст трех ваших друзей, в качестве имен переменных использовать имена друзей,
найти сумму и вывести ее на экран.
"""

valera = 36
roma = 35
dima = 31

print(valera + roma + dima)