"""
Создать список состоящий из отдельных единичных символов,
преобразовать список в строку, инвертировать строку и вывести на печать.
"""

my_spisok_list = ['m', 'y', '_', 's', 'p', 'i', 's', 'o', 'k']
my_spisok_str = "".join(my_spisok_list)
print(my_spisok_str)
